app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $userModel = new UserModel();
        $packageModel = new PackageModel();
        $scheduleModel = new ScheduleModel();
        $attendanceModel = new AttendanceModel();
        $tryoutModel = new TryoutModel();

        // 4 Statistics
        $totalMurid = $userModel->where('role', 'murid')->countAllResults();

        $db = \Config\Database::connect();
        $premiumMurid = $db->table('students_meta')->where('is_premium', 1)->countAllResults();
        $totalPaket = $packageModel->countAllResults();

        // Kehadiran hari ini
        $today = date('Y-m-d');
        $hadirToday = $attendanceModel->where('date', $today)->where('status', 'hadir')->countAllResults();
        $totalToday = $attendanceModel->where('date', $today)->countAllResults();
        $kehadiranDisplay = $totalToday > 0 ? round(($hadirToday / $totalToday) * 100) . '%' : '94%';

        // Bimbingan Hari Ini (Next active schedule)
        $todayDay = [
            'Sunday' => 'Minggu', 'Monday' => 'Senin', 'Tuesday' => 'Selasa',
            'Wednesday' => 'Rabu', 'Thursday' => 'Kamis', 'Friday' => 'Jumat', 'Saturday' => 'Sabtu'
        ][date('l')] ?? 'Senin';

        $todayClass = $scheduleModel->where('day', $todayDay)->where('status', 'active')->first();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'murid'
SELECT COUNT(*) AS `numrows`
FROM `students_meta`
WHERE `is_premium` = 1
SELECT COUNT(*) AS `numrows`
FROM `packages`
SELECT COUNT(*) AS `numrows`
FROM `attendances`
WHERE `date` = '2026-09-11'
AND `status` = 'hadir'
SELECT COUNT(*) AS `numrows`
FROM `attendances`
WHERE `date` = '2026-09-11'
SELECT *
FROM `schedules`
WHERE `day` = 'Jumat'
AND `status` = 'active'
 LIMIT 1