app/Controllers/Admin/Murid.php

    public function index()
    {
        $db = \Config\Database::connect();
        $totalMurid = $this->userModel->where('role', 'murid')->countAllResults();
        $premiumMurid = $db->table('students_meta')->where('is_premium', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'murid'
SELECT COUNT(*) AS `numrows`
FROM `students_meta`
WHERE `is_premium` = 1