app/Controllers/Murid/Jadwal.php

    public function index()
    {
        $scheduleModel = new ScheduleModel();

        $todayDay = [
            'Sunday' => 'Minggu', 'Monday' => 'Senin', 'Tuesday' => 'Selasa',
            'Wednesday' => 'Rabu', 'Thursday' => 'Kamis', 'Friday' => 'Jumat', 'Saturday' => 'Sabtu'
        ][date('l')] ?? 'Senin';

        $selectedDay = $this->request->getGet('day') ?? $todayDay;

        // Today's first active class
        $todayClass = $scheduleModel->where('day', $todayDay)->where('status', 'active')->first();
        if (!$todayClass) {
            $todayClass = $scheduleModel->where('status', 'active')->first();
        }

        // Schedules for selected day
        $daySchedules = $scheduleModel->where('day', $selectedDay)->where('status', 'active')->orderBy('start_time', 'ASC')->findAll();
---
SELECT *
FROM `schedules`
WHERE `day` = 'Jumat'
AND `status` = 'active'
 LIMIT 1
SELECT *
FROM `schedules`
WHERE `day` = 'Jumat'
AND `status` = 'active'
ORDER BY `start_time` ASC