app/Controllers/Auth.php

    public function processLogin()
    {
        $role     = $this->request->getPost('role') ?? 'murid';
        $username = trim($this->request->getPost('username') ?? '');
        $password = $this->request->getPost('password') ?? '';

        if (empty($username) || empty($password)) {
            return redirect()->back()->withInput()->with('error', 'Silakan masukkan username dan password.');
        }

        $user = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'simon'
 LIMIT 1

    public function processVerifyPassword()
    {
        $password = $this->request->getPost('password') ?? '';
        $redirect = $this->request->getPost('redirect_target') ?? 'admin/soal';
        $userId   = session()->get('user_id');

        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1