app/Models/SettingModel.php

    public function getMap()
    {
        $rows = $this->findAll();
---
SELECT *
FROM `settings`