app/Models/TryoutModel.php

SELECT `ts`.*, `u`.`name` as `student_name`, `u`.`username` as `student_username`, `p`.`title` as `package_title`, `p`.`type` as `package_type`
FROM `tryout_sessions` `ts`
INNER JOIN `users` `u` ON `u`.`id` = `ts`.`user_id`
INNER JOIN `packages` `p` ON `p`.`id` = `ts`.`package_id`
ORDER BY `ts`.`id` DESC
---
    public function getTryoutResultsWithDetails($packageType = null, $search = null, $tentorId = null)
    {
        $builder = $this->db->table('tryout_sessions ts');
        $builder->select('ts.*, u.name as student_name, u.username as student_username, p.title as package_title, p.type as package_type, p.created_by, tentor.name as author_name');
        $builder->join('users u', 'u.id = ts.user_id', 'inner');
        $builder->join('packages p', 'p.id = ts.package_id', 'inner');
        $builder->join('users tentor', 'tentor.id = p.created_by', 'left');

        if ($packageType) {
            $builder->where('p.type', $packageType);
        }
        if ($tentorId !== null) {
            $builder->where('p.created_by', $tentorId);
        }
        if ($search) {
            $builder->groupStart()
                ->like('u.name', $search)
                ->orLike('u.username', $search)
                ->orLike('p.title', $search)
                ->groupEnd();
        }

        $builder->orderBy('ts.id', 'DESC');
        return $builder->get()->getResultArray();