app/Models/UserModel.php

    public function getStudentDetail($id)
    {
        return $this->select('users.*, students_meta.is_premium, students_meta.premium_start, students_meta.premium_expiry, students_meta.attendance_rate')
            ->join('students_meta', 'students_meta.user_id = users.id', 'left')
            ->where('users.id', $id)
            ->where('users.role', 'murid')
            ->first();
---
SELECT `users`.*, `students_meta`.`is_premium`, `students_meta`.`premium_start`, `students_meta`.`premium_expiry`, `students_meta`.`attendance_rate`
FROM `users`
LEFT JOIN `students_meta` ON `students_meta`.`user_id` = `users`.`id`
WHERE `users`.`id` = 3
AND `users`.`role` = 'murid'
 LIMIT 1